apache/nuttx/arch/arm/src/stm32h5/stm32_fdcan_socket.c
/****************************************************************************
 * arch/arm/src/stm32h5/stm32_fdcan_socket.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <time.h>
#include <unistd.h>
#include <debug.h>
#include <errno.h>

#include <nuttx/can.h>
#include <nuttx/wdog.h>
#include <nuttx/irq.h>
#include <nuttx/arch.h>
#include <nuttx/wqueue.h>
#include <nuttx/signal.h>
#include <nuttx/net/netdev.h>
#include <nuttx/net/can.h>

#if defined(CONFIG_NET_CAN_RAW_TX_DEADLINE) || defined(CONFIG_NET_TIMESTAMP)
#  include <sys/time.h>
#endif

#include <arch/board/board.h>

#include "arm_internal.h"
#include "stm32_fdcan.h"
#include "hardware/stm32_pinmap.h"
#include "chip.h"
#include "stm32.h"

/* Workaround to enable CANFD globally.
 * The legacy SocketCan driver needs CANFD enabled but this driver will not
 * compile with CANFD enabled, disabling it locally only for this driver.
 */
#ifdef CONFIG_NET_CAN_CANFD
#  undef CONFIG_NET_CAN_CANFD
#endif

#ifdef CONFIG_STM32_FDCAN1
#  ifndef STM32H5_FDCAN1_PWR
#    error "STM32H5_FDCAN1_PWR for FDCAN1 must be defined in board.h!"
#  endif
#  ifndef STM32H5_FDCAN1_PWR_STANDBY
#    error "STM32H5_FDCAN1_PWR_STANDBY for FDCAN1 must be defined in board.h!"
#  endif
#endif

#ifdef CONFIG_STM32_FDCAN2
#  ifndef STM32H5_FDCAN2_PWR
#    error "STM32H5_FDCAN2_PWR for FDCAN2 must be defined in board.h!"
#  endif
#  ifndef STM32H5_FDCAN2_PWR_STANDBY
#    error "STM32H5_FDCAN2_PWR_STANDBY for FDCAN2 must be defined in board.h!"
#  endif
#endif

#ifdef CONFIG_STM32_FDCAN3
#  ifndef STM32H5_FDCAN3_PWR
#    error "STM32H5_FDCAN3_PWR for FDCAN3 must be defined in board.h!"
#  endif
#  ifndef STM32H5_FDCAN3_PWR_STANDBY
#    error "STM32H5_FDCAN3_PWR_STANDBY for FDCAN2 must be defined in board.h!"
#  endif
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define FDCAN_CMNERR_INTS   (FDCAN_INT_MRAF | FDCAN_INT_TOO | FDCAN_INT_EP | \
                            FDCAN_INT_BO | FDCAN_INT_WDI | FDCAN_INT_PEA | \
                            FDCAN_INT_PED)

#define FDCAN_RXERR_INTS    (FDCAN_INT_RF0L | FDCAN_INT_RF1L)

#define FDCAN_TXERR_INTS    (FDCAN_INT_TEFL | FDCAN_INT_PEA | FDCAN_INT_PED)

/* Common-, TX- and RX-Error-Mask */

#define FDCAN_ANYERR_INTS (FDCAN_CMNERR_INTS | FDCAN_RXERR_INTS | FDCAN_TXERR_INTS)

#define CAN_ERROR_PASSIVE_THRESHOLD 128

#define CAN_ERROR_WARNING_THRESHOLD 96

#define FDCAN_MSGRAM_WORDS         (212)
#define STM32_CANRAM1_BASE         (STM32_FDCAN_SRAM_BASE + 0x0000)
#define STM32_CANRAM2_BASE         (STM32_FDCAN_SRAM_BASE + 1*(FDCAN_MSGRAM_WORDS * 4))

#ifdef CONFIG_STM32_FDCAN1
#  define FDCAN1_STDFILTER_SIZE    (28)
#  define FDCAN1_EXTFILTER_SIZE    (8)
#  define FDCAN1_RXFIFO0_SIZE      (3)
#  define FDCAN1_RXFIFO1_SIZE      (3)
#  define FDCAN1_TXEVENTFIFO_SIZE  (3)
#  define FDCAN1_TXFIFIOQ_SIZE     (3)

#  define FDCAN1_STDFILTER_WORDS   (28)
#  define FDCAN1_EXTFILTER_WORDS   (16)
#  define FDCAN1_RXFIFO0_WORDS     (54)
#  define FDCAN1_RXFIFO1_WORDS     (54)
#  define FDCAN1_TXEVENTFIFO_WORDS (6)
#  define FDCAN1_TXFIFIOQ_WORDS    (54)
#endif
#ifdef CONFIG_STM32_FDCAN2
#  define FDCAN2_STDFILTER_SIZE    (28)
#  define FDCAN2_EXTFILTER_SIZE    (8)
#  define FDCAN2_RXFIFO0_SIZE      (3)
#  define FDCAN2_RXFIFO1_SIZE      (3)
#  define FDCAN2_TXEVENTFIFO_SIZE  (3)
#  define FDCAN2_TXFIFIOQ_SIZE     (3)

#  define FDCAN2_STDFILTER_WORDS   (28)
#  define FDCAN2_EXTFILTER_WORDS   (16)
#  define FDCAN2_RXFIFO0_WORDS     (54)
#  define FDCAN2_RXFIFO1_WORDS     (54)
#  define FDCAN2_TXEVENTFIFO_WORDS (6)
#  define FDCAN2_TXFIFIOQ_WORDS    (54)
#endif

/* FDCAN1 Message RAM Layout */

#define FDCAN1_STDFILTER_INDEX   0
#define FDCAN1_EXTFILTERS_INDEX  (FDCAN1_STDFILTER_INDEX + FDCAN1_STDFILTER_WORDS)
#define FDCAN1_RXFIFO0_INDEX     (FDCAN1_EXTFILTERS_INDEX + FDCAN1_EXTFILTER_WORDS)
#define FDCAN1_RXFIFO1_INDEX     (FDCAN1_RXFIFO0_INDEX + FDCAN1_RXFIFO0_WORDS)
#define FDCAN1_TXEVENTFIFO_INDEX (FDCAN1_RXFIFO1_INDEX + FDCAN1_RXFIFO1_WORDS)
#define FDCAN1_TXFIFOQ_INDEX     (FDCAN1_TXEVENTFIFO_INDEX + FDCAN1_TXEVENTFIFO_WORDS)
#define FDCAN1_MSGRAM_WORDS      (FDCAN1_TXFIFOQ_INDEX + FDCAN1_TXFIFIOQ_WORDS)

#define FDCAN2_STDFILTER_INDEX   0
#define FDCAN2_EXTFILTERS_INDEX  (FDCAN2_STDFILTER_INDEX + FDCAN2_STDFILTER_WORDS)
#define FDCAN2_RXFIFO0_INDEX     (FDCAN2_EXTFILTERS_INDEX + FDCAN2_EXTFILTER_WORDS)
#define FDCAN2_RXFIFO1_INDEX     (FDCAN2_RXFIFO0_INDEX + FDCAN2_RXFIFO0_WORDS)
#define FDCAN2_TXEVENTFIFO_INDEX (FDCAN2_RXFIFO1_INDEX + FDCAN2_RXFIFO1_WORDS)
#define FDCAN2_TXFIFOQ_INDEX     (FDCAN2_TXEVENTFIFO_INDEX + FDCAN2_TXEVENTFIFO_WORDS)
#define FDCAN2_MSGRAM_WORDS      (FDCAN2_TXFIFOQ_INDEX + FDCAN2_TXFIFIOQ_WORDS)

/* General Configuration ****************************************************/

#if !defined(CONFIG_SCHED_WORKQUEUE)
#  error Work queue support is required; HPWORK is recommended
#else

/* If processing is not done at the interrupt level, then work queue support
 * is required.
 *
 * The high-priority work queue is suggested in order to minimize latency of
 * critical Rx/Tx transactions on the CAN bus.
 */

#  if defined(CONFIG_STM32_FDCAN_HPWORK)
#    define CANWORK HPWORK
#  elif defined(CONFIG_STM32_FDCAN_LPWORK)
#    define CANWORK LPWORK
#  else
#    define CANWORK LPWORK
#  endif
#endif

