apache/nuttx/arch/arm/src/stm32h5/stm32_fdcan_socket.c
      /* Store into message RAM */

      mb->header.w1 = header.w1;
      mb->header.w0 = header.w0;

      uint32_t *frame_data_word = (uint32_t *)&frame->data[0];

      for (int i = 0; i < (frame->len + 4 - 1) / 4; i++)
        {
          mb->data[i].word = frame_data_word[i];
        }
    }
#endif

  /* GO - Submit the transmission request for this element */

  putreg32((1 << mbi), priv->base + STM32_FDCAN_TXBTIE_OFFSET);

  putreg32(1 << mbi, priv->base + STM32_FDCAN_TXBAR_OFFSET);

  /* Increment statistics */

  NETDEV_TXPACKETS(&priv->dev);

  priv->txmb[mbi].pending = TX_BUSY;

#ifdef TX_TIMEOUT_WQ
  /* Setup the TX timeout watchdog (perhaps restarting the timer) */

  if (timeout > 0)
    {
      wd_start(&priv->txmb[mbi].txtimeout, timeout + 1,
               fdcan_txtimeout_expiry, (wdparm_t)priv);
    }
#endif

  leave_critical_section(flags);

  return OK;
}

/****************************************************************************
 * Function: fdcan_txpoll
 *
 * Description:
 *   The transmitter is available, check if the network has any outgoing
 *   packets ready to send.  This is a callback from devif_poll().
 *   devif_poll() may be called:
 *
 *   1. When the preceding TX packet send is complete,
 *   2. When the preceding TX packet send timesout and the interface is reset
 *   3. During normal TX polling
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 * Assumptions:
 *   May or may not be called from an interrupt handler.  In either case,
 *   global interrupts are disabled, either explicitly or indirectly through
 *   interrupt handling logic.
 *
 ****************************************************************************/

static int fdcan_txpoll(struct net_driver_s *dev)
{
  struct fdcan_driver_s *priv =
    (struct fdcan_driver_s *)dev->d_private;

  /* If the polling resulted in data that should be sent out on the network,
   * the field d_len is set to a value > 0.
   */

  if (priv->dev.d_len > 0)
    {
      /* Send the packet */

      fdcan_transmit(priv);

      /* Check if there is room in the device to hold another packet. If
       * not, return a non-zero value to terminate the poll.
       */

      if (fdcan_txringfull(priv))
        {
          return -EBUSY;
        }
    }

  /* If zero is returned, the polling will continue until all connections
   * have been examined.
   */

  return 0;
}

/****************************************************************************
 * Function: fdcan_receive
 *
 * Description:
 *   Called from interrupt context.  Drains both RX FIFO0 and FIFO1 into
 *   the rx_pool ring buffer, acks the RX interrupt, and schedules
 *   fdcan_receive_work to pass the frames up to the upper layer.
 *
 * Input Parameters:
 *   priv  - Reference to the driver state structure
 *
 ****************************************************************************/

static void fdcan_receive(struct fdcan_driver_s *priv)
{
  /* Check the interrupt value to determine which FIFO(s) to read */

  uint32_t ir = getreg32(priv->base + STM32_FDCAN_IR_OFFSET);

  const uint32_t ir_fifo0 = FDCAN_INT_RF0N | FDCAN_INT_RF0F;
  const uint32_t ir_fifo1 = FDCAN_INT_RF1N | FDCAN_INT_RF1F;

  uint32_t ack_flags = 0;

  /* Drain both FIFOs if they have pending frames */

  for (int fifo_id = 0; fifo_id <= 1; fifo_id++)
    {
      uint32_t ir_mask = (fifo_id == 0) ? ir_fifo0 : ir_fifo1;

      if ((ir & ir_mask) == 0)
        {
          continue;
        }

      uint32_t offset_rxfns = (fifo_id == 0) ? STM32_FDCAN_RXF0S_OFFSET
                                              : STM32_FDCAN_RXF1S_OFFSET;
      uint32_t offset_rxfna = (fifo_id == 0) ? STM32_FDCAN_RXF0A_OFFSET
                                              : STM32_FDCAN_RXF1A_OFFSET;

      volatile uint32_t *const rxfns =
        (uint32_t *)(priv->base + offset_rxfns);
      volatile uint32_t *const rxfna =
        (uint32_t *)(priv->base + offset_rxfna);

      /* Drain all available elements from this FIFO into rx_pool */

      while ((*rxfns & FDCAN_RXFS_FFL_MASK) > 0)
        {
          if (priv->rx_pool_count >= RX_POOL_SIZE)
            {
              /* Pool full -- cannot store more; frames remain in HW FIFO */

              NETDEV_RXERRORS(&priv->dev);
              break;
            }

          const uint8_t gi = (*rxfns & FDCAN_RXFS_FGI_MASK) >>
                              FDCAN_RXFS_FGI_SHIFT;
          struct rx_fifo_s *rf;

          if (fifo_id == 0)
            {
              rf = (struct rx_fifo_s *)(priv->config->msgram.rxfifo0 +
                    priv->config->rxfifo0esize * gi);
            }
          else
            {
              rf = (struct rx_fifo_s *)(priv->config->msgram.rxfifo1 +
                    priv->config->rxfifo1esize * gi);
            }

          /* Copy frame from message RAM into the rx_pool slot */

          const size_t frame_slot_size = sizeof(FRAME_TYPE) + MSG_DATA;
          uint8_t *slot =
            &priv->rx_pool[priv->rx_pool_head * frame_slot_size];

#ifdef CONFIG_NET_CAN_CANFD
          if (rf->header.fdf)
            {
              struct canfd_frame *frame = (struct canfd_frame *)slot;

              if (rf->header.id.xtd)
                {
                  frame->can_id  = CAN_EFF_MASK & rf->header.id.extid;
                  frame->can_id |= CAN_EFF_FLAG;
                }
              else
                {
                  frame->can_id = CAN_SFF_MASK & rf->header.id.stdid;
                }

              if (rf->header.id.rtr)
                {
                  frame->can_id |= CAN_RTR_FLAG;
                }

              frame->len = can_dlc_to_len[rf->header.dlc];

              uint32_t *frame_data_word = (uint32_t *)&frame->data[0];

              for (int i = 0; i < (frame->len + 4 - 1) / 4; i++)
                {
                  frame_data_word[i] = rf->data[i].word;
                }
            }
          else
#endif
            {
              struct can_frame *frame = (struct can_frame *)slot;

              if (rf->header.id.xtd)
                {
                  frame->can_id  = CAN_EFF_MASK & rf->header.id.extid;
                  frame->can_id |= CAN_EFF_FLAG;
                }
              else
                {
                  frame->can_id = CAN_SFF_MASK & rf->header.id.stdid;
                }

