apache/nuttx/arch/arm/src/stm32h5/stm32_fdcan_socket.c
              if (rf->header.id.rtr)
                {
                  frame->can_id |= CAN_RTR_FLAG;
                }

              frame->can_dlc = rf->header.dlc;

              *(uint32_t *)&frame->data[0] = rf->data[0].word;
              *(uint32_t *)&frame->data[4] = rf->data[1].word;
            }

          /* Acknowledge receipt of this FIFO element in the HW */

          putreg32(gi, rxfna);

          /* Advance the pool head */

          priv->rx_pool_head = (priv->rx_pool_head + 1) % RX_POOL_SIZE;
          priv->rx_pool_count++;
        }

      if ((*rxfns & FDCAN_RXFS_FFL_MASK) == 0)
        {
          /* FIFO fully drained -- safe to ack its interrupt flags */

          ack_flags |= ir_mask;
        }
      else
        {
          /* Pool was full, FIFO still has frames.  Disable this FIFO's
           * interrupts to prevent an interrupt storm.  The worker will
           * re-enable them after consuming pool entries; the un-acked IR
           * flag will then immediately re-trigger this ISR.
           */

          uint32_t ie = getreg32(priv->base + STM32_FDCAN_IE_OFFSET);

          ie &= ~ir_mask;
          putreg32(ie, priv->base + STM32_FDCAN_IE_OFFSET);
        }
    }

  /* Only ack interrupt flags for FIFOs that were fully drained */

  if (ack_flags != 0)
    {
      putreg32(ack_flags, priv->base + STM32_FDCAN_IR_OFFSET);
    }

  /* Schedule the worker to consume the pooled frames */

  if (priv->rx_pool_count > 0)
    {
      work_queue(CANWORK, &priv->rxwork, fdcan_receive_work, priv, 0);
    }
}

/****************************************************************************
 * Function: fdcan_receive_work
 *
 * Description:
 *   Consume frames previously stored into the rx_pool ring buffer by the
 *   fdcan_receive ISR and pass them up to the upper-half driver via
 *   can_input().  Also check for errors and timeouts.
 *
 * Input Parameters:
 *   priv  - Reference to the driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Scheduled in worker thread (HPWORK / LPWORK)
 *
 ****************************************************************************/

static void fdcan_receive_work(void *arg)
{
  net_lock();
  irqstate_t flags = enter_critical_section();

  struct fdcan_driver_s *priv = (struct fdcan_driver_s *)arg;
  const size_t frame_slot_size = sizeof(FRAME_TYPE) + MSG_DATA;

  /* Consume all frames that the ISR placed into rx_pool */

  while (priv->rx_pool_count > 0)
    {
      uint8_t *slot = &priv->rx_pool[priv->rx_pool_tail * frame_slot_size];

#ifdef CONFIG_NET_CAN_CANFD
      /* Peek at the slot to determine frame type.  The ISR stored either
       * a canfd_frame (fdf=1) or a can_frame into the slot.  We use
       * sizeof to decide -- the ISR always wrote the correct struct.
       * For simplicity we pass the larger type and set d_len accordingly.
       */

      struct canfd_frame *fd_frame = (struct canfd_frame *)slot;

      /* A CAN-FD frame will have been stored with its full canfd_frame
       * layout.  A classic frame will have been stored as can_frame.
       * We distinguish by checking if the slot was written as canfd_frame
       * (len > 8) vs can_frame.  However, since the ISR doesn't mark
       * the type, we always pass as can_frame when CANFD is enabled
       * unless the length indicates otherwise.  For now, mirror the
       * original code: try canfd first, fall back to can.
       */

      if (fd_frame->len > 8)
        {
          priv->dev.d_len = sizeof(struct canfd_frame);
          priv->dev.d_buf = slot;
        }
      else
#endif
        {
          priv->dev.d_len = sizeof(struct can_frame);
          priv->dev.d_buf = slot;
        }

      /* Send to socket interface */

      can_input(&priv->dev);

      /* Update iface statistics */

      NETDEV_RXPACKETS(&priv->dev);

      /* Advance the pool tail */

      priv->rx_pool_tail = (priv->rx_pool_tail + 1) % RX_POOL_SIZE;
      priv->rx_pool_count--;
    }

  /* Point the packet buffer back to the Tx pool */

  priv->dev.d_buf = priv->tx_pool;

  /* Check for errors and abort-transmission requests */

  fdcan_check_errors(priv);

  /* Re-enable RX FIFO interrupts that may have been disabled by the ISR
   * when the pool was full.  The un-acked IR flags will immediately
   * re-trigger the ISR once we leave the critical section.
   */

  {
    uint32_t regval = getreg32(priv->base + STM32_FDCAN_IE_OFFSET);

    regval |= FDCAN_INT_RF0N | FDCAN_INT_RF0F
              | FDCAN_INT_RF1N | FDCAN_INT_RF1F;
#ifdef CONFIG_NET_CAN_ERRORS
    regval |= FDCAN_RXERR_INTS;
#endif
    putreg32(regval, priv->base + STM32_FDCAN_IE_OFFSET);
  }

  leave_critical_section(flags);
  net_unlock();
}

/****************************************************************************
 * Function: fdcan_txdone
 *
 * Description:
 *   An interrupt was received indicating that the last TX packet(s) is done
 *
 * Input Parameters:
 *   priv  - Reference to the driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Called from interrupt context
 *
 ****************************************************************************/

static void fdcan_txdone(struct fdcan_driver_s *priv)
{
  /* Read and reset the interrupt flag */

  uint32_t ir = getreg32(priv->base + STM32_FDCAN_IR_OFFSET);

  if (ir & FDCAN_INT_TC)
    {
      putreg32(FDCAN_INT_TC, priv->base + STM32_FDCAN_IR_OFFSET);
    }
  else
    {
      nerr("Unexpected FCAN interrupt on line 1\n");
      return;
    }

  /* Schedule to perform the TX timeout processing on the worker thread */

  work_queue(CANWORK, &priv->txdwork, fdcan_txdone_work, priv, 0);
}

/****************************************************************************
 * Function: fdcan_txdone_work
 *
 * Description:
 *   Process completed transmissions, including canceling their watchdog
 *   timers if applicable
 *
 * Input Parameters:
 *   priv  - Reference to the driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Scheduled in worker thread (HPWORK / LPWORK)
 *
 ****************************************************************************/

