apache/nuttx/arch/arm/src/stm32h5/stm32_fdcan_socket.c
static void fdcan_txdone_work(void *arg)
{
  net_lock();

  irqstate_t flags = enter_critical_section();

  struct fdcan_driver_s *priv = (struct fdcan_driver_s *)arg;

  /* Update counters for successful transmissions */

  for (uint8_t i = 0; i < NUM_TX_FIFO; i++)
    {
      if ((getreg32(priv->base + STM32_FDCAN_TXBTO_OFFSET) & (1 << i)) > 0)
        {
          /* Transmission Occurred in buffer i
           *   (Not necessarily a 'new' transmission, however)
           * Check that it's a new transmission, not a previously handled
           * transmission
           */

          struct txmbstats *txi = &priv->txmb[i];

          if (txi->pending == TX_BUSY)
            {
              /* This is a transmission that just now completed */

              NETDEV_TXDONE(&priv->dev);

              txi->pending = TX_FREE;

#ifdef TX_TIMEOUT_WQ
              /* We are here because a transmission completed, so the
               * corresponding watchdog can be canceled.
               */

              wd_cancel(&priv->txmb[i].txtimeout);
#endif
            }
        }
    }

  /* Check for errors and abort-transmission requests */

  fdcan_check_errors(priv);

#ifdef CONFIG_NET_CAN_ERRORS
  uint32_t regval = 0;

  /* Turning back on PEA and PED error interrupts */

  regval = getreg32(priv->base + STM32_FDCAN_IE_OFFSET);
  regval |= (FDCAN_INT_PEA | FDCAN_INT_PED);
  putreg32(regval, priv->base + STM32_FDCAN_IE_OFFSET);
#endif

  /* There should be space for a new TX in any event
   * Poll the network for new data to transmit
   */

  devif_poll(&priv->dev, fdcan_txpoll);

  leave_critical_section(flags);
  net_unlock();
}

/****************************************************************************
 * Function: fdcan_interrupt
 *
 * Description:
 *   Common handler for all enabled FDCAN interrupts
 *
 * Input Parameters:
 *   irq     - Number of the IRQ that generated the interrupt
 *   context - Interrupt register state save info (architecture-specific)
 *   arg     - Unused
 *
 * Returned Value:
 *   Zero on success; a negated errno on failure
 *
 ****************************************************************************/

static int fdcan_interrupt(int irq, void *context,
                           void *arg)
{
  struct fdcan_driver_s *priv    = (struct fdcan_driver_s *)arg;

  DEBUGASSERT(priv != NULL);

  if (irq == priv->config->mb_irq[0])
    {
      /* Interrupt Line 0: RX FIFO events and all error groups.
       *
       * The ILS register is configured with FDCAN_ILS_SMG only, which routes
       * the SMG group (HPM, TC, TCF, TFE) to Line 1.  All other interrupt
       * groups — RXFIFO0, RXFIFO1, TFERR, MISC, BERR, PERR — remain on
       * Line 0.  Every bit in FDCAN_ANYERR_INTS belongs to one of those
       * groups, so the error check below is exhaustive on this line and can
       * never fire on Line 1.
       */

#ifdef CONFIG_NET_CAN_ERRORS
      uint32_t pending = getreg32(priv->base + STM32_FDCAN_IR_OFFSET);

      if ((pending & FDCAN_ANYERR_INTS) != 0)
        {
          /* Disable further CAN ERROR interrupts and schedule
           * to perform the interrupt processing on the worker
           * thread
           */

          fdcan_errint(priv, false);

          /* Save error IR flags and clear them (W1C) before this ISR
           * returns.
           *
           * Before fdcan_error_work runs, this ISR may be re-entered for a
           * completely unrelated reason (e.g. a valid RX frame arriving on
           * Line 0 again, or a TX completion on Line 1).  The error block
           * guard above checks IR directly, so without the W1C clear below,
           * a re-entered Line 0 ISR would re-read the same error flags,
           * overwrite saved_errflags/saved_psr, and enqueue a second
           * spurious work item.  Clearing FDCAN_ANYERR_INTS from IR now
           * ensures any re-entry sees no pending error flags.
           *
           * PSR is snapshotted here rather than in fdcan_error_work because
           * a TXBCR write below immediately transitions PSR.ACT away from
           * TRANSMITTING; a live read in the work handler would miss that
           * state.
           */

          priv->saved_errflags = pending; /* pending already holds the IR snapshot */
          putreg32(FDCAN_ANYERR_INTS, priv->base + STM32_FDCAN_IR_OFFSET);

          priv->saved_psr = getreg32(priv->base + STM32_FDCAN_PSR_OFFSET);

          /* Abort all TX MBs if an error has occurred and the
           * abort_tx_on_error flag has been set via the ioctl call
           */

          if (priv->abort_tx_on_error)
            {
              uint32_t regval =
                getreg32(priv->base + STM32_FDCAN_TXBRP_OFFSET);
              uint32_t i = 0;

              for (i = 0; i < NUM_TX_FIFO; i++)
                {
                  struct txmbstats *txi = &priv->txmb[i];

                  if (txi->pending == TX_BUSY && ((1 << i) & regval))
                    {
                      putreg32(1 << i,
                               priv->base + STM32_FDCAN_TXBCR_OFFSET);
                      txi->pending = TX_FREE;
                      NETDEV_TXERRORS(&priv->dev);
                    }
                }
            }

          work_queue(CANWORK, &priv->irqwork, fdcan_error_work, priv, 0);
        }
#endif /* CONFIG_NET_CAN_ERRORS */

      fdcan_receive(priv);
    }
  else if (irq == priv->config->mb_irq[1])
    {
      /* Interrupt Line 1: TX completion events
       * (HPM, TC, TCF, TFE via SMG).
       */

      fdcan_txdone(priv);
    }
  else
    {
      nerr("Unexpected IRQ [%d]\n", irq);
      return -EINVAL;
    }

  return OK;
}

/****************************************************************************
 * Function: fdcan_check_errors
 *
 * Description:
 *   Check error flags and cancel any timed out transmissions
 *
 * Input Parameters:
 *   priv  - Reference to the driver state structure
 *
 * Assumptions:
 *   May or may not be called from an interrupt handler.  In either case,
 *   global interrupts are disabled, either explicitly or indirectly through
 *   interrupt handling logic.
 *
 ****************************************************************************/

static void fdcan_check_errors(struct fdcan_driver_s *priv)
{
  /* Read CAN Error Logging counter (This also resets the error counter) */

  uint32_t regval = getreg32(priv->base + STM32_FDCAN_ECR_OFFSET)
                  & FDCAN_ECR_CEL_MASK;
  const uint8_t cel = (uint8_t)(regval >> FDCAN_ECR_CEL_SHIFT);

