apache/nuttx/arch/arm/src/stm32h5/stm32_fdcan_socket.c
#if 0
  /* Disable Automatic Retransmission of frames upon error
   * NOTE: This will even disable automatic retry due to lost arbitration!!
   */

  modifyreg32(priv->base + STM32_FDCAN_CCCR_OFFSET, 0, FDCAN_CCCR_DAR);
#endif

  /* Configure Interrupts */

  /* Clear all interrupt flags
   * Note: A flag is cleared by writing a 1 to the corresponding bit position
   */

  putreg32(FDCAN_IR_MASK, priv->base + STM32_FDCAN_IR_OFFSET);

  /* Enable relevant interrupts */

  regval = FDCAN_INT_TC     /* Transmit Complete */
         | FDCAN_INT_RF0N   /* Rx FIFO 0 new message */
         | FDCAN_INT_RF0F   /* Rx FIFO 0 FIFO full */
         | FDCAN_INT_RF1N   /* Rx FIFO 1 new message */
         | FDCAN_INT_RF1F;  /* Rx FIFO 1 FIFO full */
  putreg32(regval, priv->base + STM32_FDCAN_IE_OFFSET);

#ifdef CONFIG_NET_CAN_ERRORS
  fdcan_errint(priv, true);
#endif

  /* Keep Rx interrupts on Line 0; move Tx to Line 1
   * TC (Tx Complete) interrupt on line 1
   */

  regval = getreg32(priv->base + STM32_FDCAN_ILS_OFFSET);
  regval |= FDCAN_ILS_SMG;
  putreg32(FDCAN_ILS_SMG, priv->base + STM32_FDCAN_ILS_OFFSET);

  /* Enable Tx buffer transmission interrupts
   * Note: Still need fdcan_enable_interrupts() to set ILE (IR line enable)
   */

  putreg32(FDCAN_TXBTIE_TIE_MASK, priv->base + STM32_FDCAN_TXBTIE_OFFSET);

  /* RAM CONFIGURATION */

  const struct fdcan_config_s * config = priv->config;

  regval = FDCAN_RXGFC_LSS(config->nstdfilters);
  regval |= FDCAN_RXGFC_LSE(config->nextfilters);
  putreg32(regval, priv->base + STM32_FDCAN_RXGFC_OFFSET);

  msgram = config->msgram.stdfilters;
  cntr   = config->nstdfilters;
  while (cntr > 0)
    {
      *msgram++ = STDFILTER_S0_SFEC_DISABLE;
      cntr--;
    }

  msgram = config->msgram.stdfilters;

  /* Filter 0 — High priority → FIFO0 */

  msgram[0] =
      (STDFILTER_S0_SFEC_FIFO0) |      /* Store in FIFO0 */
      (STDFILTER_S0_SFT_RANGE)   |     /* Range filter */
      (0x000 << STDFILTER_S0_SFID1_SHIFT)       |
      (0x1ff << STDFILTER_S0_SFID2_SHIFT);

  /* Filter 1 — Low priority → FIFO1 */

  msgram[1] =
      (STDFILTER_S0_SFEC_FIFO1) |
      (STDFILTER_S0_SFT_RANGE)  |
      (0x200 << STDFILTER_S0_SFID1_SHIFT)      |
      (0x2ff << STDFILTER_S0_SFID2_SHIFT);

  /* Disable all extended filters */

  msgram = config->msgram.extfilters;
  cntr = config->nextfilters;
  while (cntr > 0)
    {
      *msgram = EXTFILTER_F0_EFEC_DISABLE;
      msgram = msgram + 2;
      cntr--;
    }

  msgram = config->msgram.extfilters;

  /* Filter 0 — High priority → FIFO0 */

  msgram[0] =
      (EXTFILTER_F0_EFEC_FIFO0) |
      (0x00000000 << 0);

  msgram[1] =
      (EXTFILTER_F1_EFT_RANGE) |
      (0x0fffffff << 0);

  /* Filter 1 — Low priority → FIFO1 */

  msgram[2] =
      (EXTFILTER_F0_EFEC_FIFO1) |
      (0x10000000 << 0);

  msgram[3] =
      (EXTFILTER_F1_EFT_RANGE) |
      (0x1fffffff << 0);

  /* END RAM CONFIGURATION */

  regval = getreg32(priv->base + STM32_FDCAN_TXBC_OFFSET);
  regval &= ~FDCAN_TXBC_TFQM;  /* Use FIFO */
  putreg32(regval, priv->base + STM32_FDCAN_TXBC_OFFSET);

  /* Default filter configuration - Accept all messages into Rx FIFO1 */

  regval = getreg32(priv->base + STM32_FDCAN_RXGFC_OFFSET);
  regval &= ~FDCAN_RXGFC_ANFS_MASK;     /* Clear */
  regval &= ~FDCAN_RXGFC_ANFE_MASK;     /* Clear */
  regval |= FDCAN_RXGFC_ANFS_RX_FIFO1;  /* Accept non-matching stdid frames into FIFO1 */
  regval |= FDCAN_RXGFC_ANFE_RX_FIFO1;  /* Accept non-matching extid frames into FIFO1 */
  putreg32(regval, priv->base + STM32_FDCAN_RXGFC_OFFSET);

#ifdef CONFIG_STM32_FDCAN_REGDEBUG
  fdcan_dumpregs(priv);
#endif

  /* Exit Initialization mode */

  fdcan_setinit(priv->base, 0);

#ifdef CONFIG_STM32_FDCAN_REGDEBUG
  fdcan_dumpregs(priv);
#endif

  leave_critical_section(flags);

  return 0;
}

/****************************************************************************
 * Function: fdcan_reset
 *
 * Description:
 *   Put the device in the non-operational, reset state
 *
 * Input Parameters:
 *   priv - Pointer to the private FDCAN driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   The device has previously been initialized, including message RAM
 ****************************************************************************/

static void fdcan_reset(struct fdcan_driver_s *priv)
{
  /* Request Init Mode */

  irqstate_t flags = enter_critical_section();

  fdcan_setenable(priv->base, 1);
  fdcan_setinit(priv->base, 1);

  /* Enable Configuration Change Mode */

  fdcan_setconfig(priv->base, 1);

  /* Disable interrupts and clear all interrupt flags */

  fdcan_disable_interrupts(priv);

  putreg32(FDCAN_IR_MASK, priv->base + STM32_FDCAN_IR_OFFSET);

  /* Clear all message RAM mailboxes if initialized */

#ifdef CONFIG_NET_CAN_CANFD
  const uint8_t n_data_words = 16;
#else
  const uint8_t n_data_words = 2;
#endif

  for (uint32_t f = 0; f < 2; f++)
    {
      for (uint32_t i = 0; i < NUM_RX_FIFO0; i++)
        {
          struct rx_fifo_s *mb;

          if (f == 0)
            {
              mb = (struct rx_fifo_s *)(priv->config->msgram.rxfifo0 +
                                        priv->config->rxfifo0esize * i);
            }
          else
            {
              mb = (struct rx_fifo_s *)(priv->config->msgram.rxfifo1 +
                                        priv->config->rxfifo1esize * i);
            }

#ifdef CONFIG_STM32_FDCAN_REGDEBUG
          ninfo("[fdcan] MB RX%i %i %p\r\n", f, i, mb);
#endif
          mb->header.w1 = 0x0;
          mb->header.w0 = 0x0;
          for (uint8_t j = 0; j < n_data_words; j++)
            {
              mb->data[j].word = 0x0;
            }
        }
    }

  for (uint32_t i = 0; i < NUM_TX_FIFO; i++)
    {
      struct tx_fifo_s *mb =
        (struct tx_fifo_s *)(priv->config->msgram.txfifoq +
                             priv->config->txbufferesize * i);

#ifdef CONFIG_STM32_FDCAN_REGDEBUG
      ninfo("[fdcan] MB TX %i %p\r\n", i, mb);
#endif
      mb->header.w1 = 0x0;
      mb->header.w0 = 0x0;
      for (uint8_t j = 0; j < n_data_words; j++)
        {
          mb->data[j].word = 0x0;
        }
    }

