apache/nuttx/arch/arm/src/stm32h5/stm32_fdcan_socket.c
  /* Power off the device -- See RM0433 pg 2493 */

  fdcan_setinit(priv->base, 0);
  fdcan_setenable(priv->base, 0);

  leave_critical_section(flags);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Function: stm32_fdcanh5sockinitialize
 *
 * Description:
 *   Initialize the selected CAN peripheral and network (socket) interface
 *
 * Input Parameters:
 *   intf - In the case where there are multiple interfaces, this value
 *          identifies which interface is to be initialized.
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

int stm32_fdcanh5sockinitialize(int intf, char *ifname)
{
  struct fdcan_driver_s *priv;

  switch (intf)
    {
#ifdef CONFIG_STM32_FDCAN1
      case 1:
        priv             = &g_fdcan0;
        memset(priv, 0, sizeof(struct fdcan_driver_s));
        priv->base       = STM32_FDCAN1_BASE;
        priv->iface_idx  = 0;
        priv->config     = &stm32_fdcan0_config;
        priv->pwr_pin = STM32H5_FDCAN1_PWR;
        priv->pwr_pin_standby = STM32H5_FDCAN1_PWR_STANDBY;

        /* Default bitrate configuration */

#  ifdef CONFIG_NET_CAN_CANFD
        priv->arbi_timing.bitrate = CONFIG_FDCAN1_ARBI_BITRATE;
        priv->data_timing.bitrate = CONFIG_FDCAN1_DATA_BITRATE;
#  else
        priv->arbi_timing.bitrate = CONFIG_STM32_FDCAN1_BITRATE;
#  endif
        break;
#endif /* CONFIG_STM32_FDCAN1 */

#ifdef CONFIG_STM32_FDCAN2
      case 2:
        priv             = &g_fdcan1;
        memset(priv, 0, sizeof(struct fdcan_driver_s));
        priv->base       = STM32_FDCAN2_BASE;
        priv->iface_idx  = 1;
        priv->config     = &stm32_fdcan1_config;
        priv->pwr_pin = STM32H5_FDCAN2_PWR;
        priv->pwr_pin_standby = STM32H5_FDCAN2_PWR_STANDBY;

        /* Default bitrate configuration */

#  ifdef CONFIG_NET_CAN_CANFD
        priv->arbi_timing.bitrate = CONFIG_FDCAN2_ARBI_BITRATE;
        priv->data_timing.bitrate = CONFIG_FDCAN2_DATA_BITRATE;
#  else
        priv->arbi_timing.bitrate = CONFIG_STM32_FDCAN2_BITRATE;
#  endif
        break;
#endif /* CONFIG_STM32_FDCAN2 */

#ifdef CONFIG_STM32_FDCAN3
      case 2:
        priv             = &g_fdcan2
        memset(priv, 0, sizeof(struct fdcan_driver_s));
        priv->base       = STM32_FDCAN3_BASE;
        priv->iface_idx  = 2;
        priv->config     = &stm32_fdcan2_config;
        priv->pwr_pin = STM32H5_FDCAN3_PWR;
        priv->pwr_pin_standby = STM32H5_FDCAN3_PWR_STANDBY;

        /* Default bitrate configuration */

#  ifdef CONFIG_NET_CAN_CANFD
        priv->arbi_timing.bitrate = CONFIG_FDCAN3_ARBI_BITRATE;
        priv->data_timing.bitrate = CONFIG_FDCAN3_DATA_BITRATE;
#  else
        priv->arbi_timing.bitrate = CONFIG_FDCAN3_BITRATE;
#  endif
        break;
#endif /* CONFIG_STM32_FDCAN3 */

      default:
        return -ENODEV;
    }

  if (fdcan_bittiming(&priv->arbi_timing) != OK)
    {
      printf("ERROR: Invalid CAN timings\n");
      return -1;
    }

#ifdef CONFIG_NET_CAN_CANFD
  if (fdcan_bittiming(&priv->data_timing) != OK)
    {
      printf("ERROR: Invalid CAN data phase timings\n");
      return -1;
    }
#endif

  /* Configure the pins we're using to interface to the controller */

  stm32_configgpio(priv->config->tx_pin);
  stm32_configgpio(priv->config->rx_pin);

  stm32_configgpio(priv->pwr_pin);
  stm32_gpiowrite(priv->pwr_pin, priv->pwr_pin_standby);

  /* Attach the fdcan interrupt handlers */

  if (irq_attach(priv->config->mb_irq[0], fdcan_interrupt, priv))
    {
      /* We could not attach the ISR to the interrupt */

      printf("ERROR: Failed to attach CAN RX IRQ\n");
      return -EAGAIN;
    }

  if (irq_attach(priv->config->mb_irq[1], fdcan_interrupt, priv))
    {
      /* We could not attach the ISR to the interrupt */

      printf("ERROR: Failed to attach CAN TX IRQ\n");
      return -EAGAIN;
    }

  /* Initialize the driver structure */

  strlcpy(priv->dev.d_ifname, ifname, IFNAMSIZ);
  priv->dev.d_ifup    = fdcan_ifup;     /* I/F up callback */
  priv->dev.d_ifdown  = fdcan_ifdown;   /* I/F down callback */
  priv->dev.d_txavail = fdcan_txavail;  /* New TX data callback */
#ifdef CONFIG_NETDEV_IOCTL
  priv->dev.d_ioctl   = fdcan_netdev_ioctl;    /* Support CAN ioctl() calls */
#endif
  priv->dev.d_private = (void *)priv;   /* Used to recover private state from dev */

  priv->dev.d_buf = priv->tx_pool;

  /* Put the interface in the down state (disable interrupts, power off) */

  fdcan_ifdown(&priv->dev);

  /* Register the device with the OS so that socket IOCTLs can be performed */

  netdev_register(&priv->dev, NET_LL_CAN);

#ifdef CONFIG_STM32_FDCAN_REGDEBUG
  fdcan_dumpregs(priv);
#endif

  return OK;
}

/****************************************************************************
 * Name: arm_netinitialize
 *
 * Description:
 *   Initialize the CAN device interfaces.  If there is more than one device
 *   interface in the chip, then board-specific logic will have to provide
 *   this function to determine which, if any, CAN interfaces should be
 *   initialized.
 *
 ****************************************************************************/

#if !defined(CONFIG_NETDEV_LATEINIT)
void arm_netinitialize(void)
{
#ifdef CONFIG_STM32_FDCAN1
  stm32_fdcanh5sockinitialize(1, "can0");
#endif

#ifdef CONFIG_STM32_FDCAN2
  stm32_fdcanh5sockinitialize(2, "can1");
#endif

#ifdef CONFIG_STM32_FDCAN3
  stm32_fdcanh5sockinitialize(3, "can2");
#endif
}
#endif /* !defined(CONFIG_NETDEV_LATEINIT) */

#ifdef CONFIG_NET_CAN_ERRORS
/****************************************************************************
 * Name: fdcan_error_work
 ****************************************************************************/

static void fdcan_error_work(void *arg)
{
  struct fdcan_driver_s *priv    = (struct fdcan_driver_s *)arg;
  uint32_t              pending = 0;
  uint32_t              ir      = 0;
  uint32_t              psr     = 0;

