apache/nuttx/arch/arm/src/stm32h5/stm32_fdcan_socket.c
  ir  = priv->saved_errflags; /* Error IR flags captured and cleared in ISR */
  psr = priv->saved_psr;      /* PSR captured at ISR time, before TXBCR write */

  pending = ir;

  /* Check for common errors */

  if ((pending & FDCAN_CMNERR_INTS) != 0)
    {
      /* When a protocol error occurs, the problem is recorded in
       * the LEC/DLEC fields of the PSR register. In lieu of
       * separate interrupt flags for each error, the hardware
       * groups protocol errors under a single interrupt each for
       * arbitration and data phases.
       *
       * These errors have a tendency to flood the system with
       * interrupts, so they are disabled here until we get a
       * successful transfer/receive on the hardware
       */

      /* Clear the error indications */

      putreg32(FDCAN_CMNERR_INTS, priv->base + STM32_FDCAN_IR_OFFSET);
    }

  /* Check for transmission errors */

  if ((pending & FDCAN_TXERR_INTS) != 0)
    {
      /* An Acknowledge-Error will occur if for example the device
       * is not connected to the bus.
       *
       * The CAN-Standard states that the Chip has to retry the
       * message forever, which will produce an ACKE every time.
       * To prevent this Interrupt-Flooding and the high CPU-Load
       * we disable the ACKE here as long we didn't transfer at
       * least one message successfully (see FDCAN_INT_TC below).
       */

      /* Clear the error indications */

      putreg32(FDCAN_TXERR_INTS, priv->base + STM32_FDCAN_IR_OFFSET);
    }

  /* Check for reception errors */

  if ((pending & FDCAN_RXERR_INTS) != 0)
    {
      /* To prevent Interrupt-Flooding the current active
       * RX error interrupts are disabled. After successfully
       * receiving at least one CAN packet all RX error interrupts
       * are turned back on.
       *
       * The Interrupt-Flooding can for example occur if the
       * configured CAN speed does not match the speed of the other
       * CAN nodes in the network.
       */

      /* Clear the error indications */

      putreg32(FDCAN_RXERR_INTS, priv->base + STM32_FDCAN_IR_OFFSET);
    }

  /* Report errors */

  net_lock();
  fdcan_error(priv, pending & FDCAN_ANYERR_INTS, psr);
  net_unlock();

  /* Re-enable ERROR interrupts */

  fdcan_errint(priv, true);
}

/****************************************************************************
 * Name: fdcan_error
 *
 * Description:
 *   Report a CAN error
 *
 * Input Parameters:
 *   dev        - CAN-common state data
 *   status     - Interrupt status with error bits set
 *   psr        - psr register content
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void fdcan_error(struct fdcan_driver_s *priv, uint32_t status,
                        uint32_t psr)
{
  irqstate_t flags = enter_critical_section();
  struct can_frame *frame = (struct can_frame *)priv->rx_pool;
  uint32_t          errbits = 0;
  uint8_t           data[CAN_ERR_DLC];
  uint32_t regval;

  DEBUGASSERT(priv != NULL);

  /* Encode error bits */

  errbits = 0;
  memset(data, 0, sizeof(data));

  /* Always fill in "static" error conditions, but set the signaling bit
   * only if the condition has changed (see IRQ-Flags below)
   * They have to be filled in every time CAN_ERROR_CONTROLLER is set.
   */

  errbits |= CAN_ERR_CNT;
  regval = getreg32(priv->base + STM32_FDCAN_ECR_OFFSET);
  data[6] = (uint8_t)((regval & FDCAN_ECR_TEC_MASK) >> FDCAN_ECR_TEC_SHIFT);
  data[7] = (uint8_t)((regval & FDCAN_ECR_REC_MASK) >>
                      FDCAN_ECR_REC_SHIFT);

  if ((psr & FDCAN_PSR_EP) != 0)
    {
      if ((regval & FDCAN_ECR_RP) != 0)
        {
          data[1] |= (CAN_ERR_CRTL_RX_PASSIVE);
        }

      if (data[6] >= CAN_ERROR_PASSIVE_THRESHOLD)
        {
          data[1] |= (CAN_ERR_CRTL_TX_PASSIVE);
        }
    }

  if ((psr & FDCAN_PSR_EW) != 0)
    {
      if ((data[6] >= CAN_ERROR_WARNING_THRESHOLD))
        {
          data[1] |= CAN_ERR_CRTL_TX_WARNING;
        }

      if ((data[7] >= CAN_ERROR_WARNING_THRESHOLD))
        {
          data[1] |= CAN_ERR_CRTL_RX_WARNING;
        }
    }

  if ((status & (FDCAN_INT_EP | FDCAN_INT_EW)) != 0)
    {
      /* "Error Passive" or "Error Warning" status changed */

      errbits |= CAN_ERR_CRTL;
    }

  if ((status & FDCAN_INT_PEA) != 0)
    {
      /* Protocol Error in Arbitration Phase */

      if ((psr & FDCAN_PSR_ACT_MASK) == FDCAN_PSR_ACT_TRANS)
        {
          /* transmit error */

          data[2] |= CAN_ERR_PROT_TX;

          /* Used to communicate to the upper layer that a TX error has
           * occurred, which led to the TX frame being aborted
           */

          if (priv->abort_tx_on_error)
            {
              errbits |= CAN_ERR_TX_TIMEOUT;
            }
        }

      switch (psr & FDCAN_PSR_LEC_MASK)
        {
          case FDCAN_PSR_LEC(FDCAN_PSR_EC_STUFF_ERROR):

            /* Stuff Error */

            errbits |= CAN_ERR_PROT;
            data[2] |= CAN_ERR_PROT_STUFF;
            break;

          case FDCAN_PSR_LEC(FDCAN_PSR_EC_FORM_ERROR):

            /* Format Error */

            errbits |= CAN_ERR_PROT;
            data[2] |= CAN_ERR_PROT_FORM;
            break;

          case FDCAN_PSR_LEC(FDCAN_PSR_EC_ACK_ERROR):

            /* Acknowledge Error */

            errbits |= (CAN_ERR_PROT | CAN_ERR_ACK);
            break;

          case FDCAN_PSR_LEC(FDCAN_PSR_EC_BIT0_ERROR):

            /* Bit0 Error */

            errbits |= CAN_ERR_PROT;
            data[2] |= CAN_ERR_PROT_BIT0;
            break;

          case FDCAN_PSR_LEC(FDCAN_PSR_EC_BIT1_ERROR):

            /* Bit1 Error */

            errbits |= CAN_ERR_PROT;
            data[2] |= CAN_ERR_PROT_BIT1;
            break;

          case FDCAN_PSR_LEC(FDCAN_PSR_EC_CRC_ERROR):

            /* Receive CRC Error */

            errbits |= CAN_ERR_PROT;
            data[3] |= (CAN_ERR_PROT_LOC_CRC_SEQ | CAN_ERR_PROT_LOC_CRC_DEL);
            break;

          case FDCAN_PSR_LEC(FDCAN_PSR_EC_NO_CHANGE):

            /* No change (nothing has cleared the error) */

